# Data Wrangling or Data Munging

Here we will concentrate on the following sub-sections of this methodology:

1> Data collection: To understand different data retrieval mechanisms for 
                    different data types. -> in very brief

2> Data description: To understand various attributes and properties of the
                     data collected. -> in very brief

3> Data wrangling: To prepare data for consumption in the modeling steps.

4> Data visualization: To visualize different attributes for sharing results, better understanding, and so on.  -> "Covered through matplotlib"

Data Collection  -> (Covered under /pandas_for_data_analysis/data-retrieval)
---------------
Data is at the center of everything around us. This presents the fact that it must be present in different formats, shapes, and sizes. Its omnipresence also means that it exists in systems such as legacy machines (say mainframes), web (say web sites and web applications), databases, flat files, sensors, mobile devices, and so on.

For Machine Learning we need data. Data can be collected from various sources like : CSV (Comma Separated Values), JSON (Java Script Object Notation), XML or eXtensible Markup Language, Web Scraping, SQL to query databases.

Data could be structured or un-structured.

Data Description
----------------
Data colleceted has various data types like :

a> Numeric : Numeric data represents scalar information about entities being observed, for instance, number of visits to a web site, price of a product, weight of a person, and so on. For handling numeric data, we use techniques such as normalization, binning, quantization, and many more to transform numeric data as per our requirements.

b> Text : Data comprising of unstructured, alphanumeric content is one of most common data types. Textual data when representing human language content contains implicit grammatical structure and meaning. This type of data requires additional care and effort for transformation and understanding.

c> Categorical : This data type stands in between the numeric and text. Categorical variables refer to categories of entities being observed. For instance, hair color being black, brown, blonde and red or economic status as low, medium, or high. The values may be represented as numeric or alphanumeric, which describe properties of items in consideration. Based on certain characteristics, categorical variables can be seen as:

• Nominal: These define only the category of the data point without any ordering possible. For instance, hair color can be black, brown, blonde, etc., but there cannot be any order to these categories.

• Ordinal: These define category but can also be ordered based on rules on the
context. For example, people categorized by economic status of low, medium, or
high can be clearly ordered/sorted in the respective order.

Data wrangling or data munging is the process of cleaning, transforming, and mapping data from one form to another to utilize it for tasks such as analytics, summarization, reporting, visualization, and so on.

Data wrangling is one of most important and involving steps in the whole Data Science workflow. The output of this process directly impacts all downstream steps such as exploration, summarization, visualization, analysis and even the final result. This clearly shows why Data Scientists spend a lot of time in Data Collection and Wrangling.

In [107]:
# import required libraries
import random
import datetime 
import numpy as np
import pandas as pd
from random import randrange
from sklearn import preprocessing

from IPython.display import display

pd.options.mode.chained_assignment = None
import warnings; warnings.simplefilter('ignore')  # to suppress warnings

## Utilities

>>> The dataset in consideration has been generated using standard Python libraries like random, datetime, numpy, pandas, and so on. This dataset has been generated using a utility function called generate_sample_data().

>>> Students can ignore the Utilities code and concentrate on the common data munging part, which starts as "Generate sample data set"

In [108]:
def _random_date(start,date_count):
    """This function generates a random date based on params
    Args:
        start (date object): the base date
        date_count (int): number of dates to be generated
    Returns:
        list of random dates

    """
    current = start
    while date_count > 0:
        curr = current + datetime.timedelta(days=randrange(42))
        yield curr
        date_count-=1


def generate_sample_data(row_count=100):
    """This function generates a random transaction dataset
    Args:
        row_count (int): number of rows for the dataframe
    Returns:
        a pandas dataframe

    """
    
    # sentinels
    startDate = datetime.datetime(2016, 1, 1,13)
    serial_number_sentinel = 1000
    user_id_sentinel = 5001
    product_id_sentinel = 101
    price_sentinel = 2000
    
    
    # base list of attributes
    data_dict = {
    'Serial No': np.arange(row_count)+serial_number_sentinel,
    'Date': np.random.permutation(pd.to_datetime([x.strftime("%d-%m-%Y") 
                                                    for x in _random_date(startDate,
                                                                          row_count)]).date
                                  ),
    'User ID': np.random.permutation(np.random.randint(0,
                                                       row_count,
                                                       size=int(row_count/10)) + user_id_sentinel).tolist()*10,
    'Product ID': np.random.permutation(np.random.randint(0,
                                                          row_count,
                                                          size=int(row_count/10))+ product_id_sentinel).tolist()*10 ,
    'Quantity Purchased': np.random.permutation(np.random.randint(1,
                                                                  42,
                                                                  size=row_count)),
    'Price': np.round(np.abs(np.random.randn(row_count)+1)*price_sentinel,
                      decimals=2),
    'User Type':np.random.permutation([chr(random.randrange(97, 97 + 3 + 1)) 
                                            for i in range(row_count)])
    }
    
    # introduce missing values
    for index in range(int(np.sqrt(row_count))): 
        data_dict['Price'][np.argmax(data_dict['Price'] == random.choice(data_dict['Price']))] = np.nan
        data_dict['User Type'][np.argmax(data_dict['User Type'] == random.choice(data_dict['User Type']))] = np.nan
        data_dict['Date'][np.argmax(data_dict['Date'] == random.choice(data_dict['Date']))] = np.nan
        data_dict['Product ID'][np.argmax(data_dict['Product ID'] == random.choice(data_dict['Product ID']))] = 0
        data_dict['Serial No'][np.argmax(data_dict['Serial No'] == random.choice(data_dict['Serial No']))] = -1
        data_dict['User ID'][np.argmax(data_dict['User ID'] == random.choice(data_dict['User ID']))] = -101
        
    
    # create data frame
    df = pd.DataFrame(data_dict)
    
    return df
    

def describe_dataframe(df=pd.DataFrame()):
    """This function generates descriptive stats of a dataframe
    Args:
        df (dataframe): the dataframe to be analyzed
    Returns:
        None

    """
    print("\n\n")
    print("*"*30)
    print("About the Data")
    print("*"*30)
    
    print("Number of rows::",df.shape[0])
    print("Number of columns::",df.shape[1])
    print("\n")
    
    print("Column Names::",df.columns.values.tolist())
    print("\n")
    
    print("Column Data Types::\n",df.dtypes)
    print("\n")
    
    print("Columns with Missing Values::",df.columns[df.isnull().any()].tolist())
    print("\n")
    
    print("Number of rows with Missing Values::",len(pd.isnull(df).any(1).nonzero()[0].tolist()))
    print("\n")
    
    print("Sample Indices with missing data::",pd.isnull(df).any(1).nonzero()[0].tolist()[0:5])
    print("\n")
    
    print("General Stats::")
    print(df.info())
    print("\n")
    
    print("Summary Stats::")
    print(df.describe())
    print("\n")
    
    print("Dataframe Sample Rows::")
    display(df.head(5))
    
def cleanup_column_names(df,rename_dict={},do_inplace=True):
    """This function renames columns of a pandas dataframe
       It converts column names to snake case if rename_dict is not passed. 
    Args:
        rename_dict (dict): keys represent old column names and values point to 
                            newer ones
        do_inplace (bool): flag to update existing dataframe or return a new one
    Returns:
        pandas dataframe if do_inplace is set to False, None otherwise

    """
    if not rename_dict:
        return df.rename(columns={col: col.lower().replace(' ','_') 
                    for col in df.columns.values.tolist()}, 
                  inplace=do_inplace)
    else:
        return df.rename(columns=rename_dict,inplace=do_inplace)

def expand_user_type(u_type):
    """This function maps user types to user classes
    Args:
        u_type (str): user type value
    Returns:
        (str) user_class value

    """
    if u_type in ['a','b']:
        return 'new'
    elif u_type == 'c':
        return 'existing'
    elif u_type == 'd':
        return 'loyal_existing'
    else:
        return 'error'

## Generate a Sample Dataset

In [109]:
df = generate_sample_data(row_count=1000)

### Describe the Dataset

In [110]:
describe_dataframe(df)

******************************
About the Data
******************************
Number of rows:: 1000
Number of columns:: 7


Column Names:: ['Serial No', 'Date', 'User ID', 'Product ID', 'Quantity Purchased', 'Price', 'User Type']


Column Data Types::
 Serial No               int32
Date                   object
User ID                 int64
Product ID              int64
Quantity Purchased      int32
Price                 float64
User Type              object
dtype: object


Columns with Missing Values:: ['Date', 'Price']


Number of rows with Missing Values:: 61


Sample Indices with missing data:: [0, 1, 2, 3, 4]


General Stats::
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
Serial No             1000 non-null int32
Date                  969 non-null object
User ID               1000 non-null int64
Product ID            1000 non-null int64
Quantity Purchased    1000 non-null int32
Price                 969 non-null float64
User Type             1000 non-null object
dtypes: float64(1), int32(2), int64(2), object(2)
memory usage: 47.0+ KB
None


Summary Stats::
         Serial No      User ID   Product ID  Quantity Purchased        Price
count  1000.000000  1000.000000  1000.000000         1000.000000   969.000000
mean   1455.577000  5522.576000   598.144000           20.451000  2244.042167
std     379.835732   333.909601   280.725482           11.918794  1579.771424
min      -1.000000  -101.000000     0.000000            1.000000     4.850000
25%    1226.750000  5321.000000   379.000000           10.000000   972.370000
50%    1480.500000  5528.500000   585.500000           20.000000  2025.460000
75%    1742.250000  5792.500000   821.000000           31.000000  3197.960000
max    1999.000000  5995.000000  1098.000000           41.000000  8660.480000


Dataframe Sample Rows::

   Serial No Date  User ID  Product ID  Quantity Purchased    Price User Type
0       1000  NaN     -101           0                  36  1777.80         n
1       1001  NaN     5975         625                   2  1283.34         n
2       1002  NaN     5821         164                  30  2211.46         n
3       1003  NaN     5838         629                   5  1508.19         n
4       1004  NaN     5771         408                   1   904.19         n

### Rename Columns

In [111]:
print("Dataframe columns:\n{}".format(df.columns.tolist()))

Dataframe columns:
['Serial No', 'Date', 'User ID', 'Product ID', 'Quantity Purchased', 'Price', 'User Type']

In [112]:
cleanup_column_names(df)

In [113]:
print("Dataframe columns:\n{}".format(df.columns.tolist()))

Dataframe columns:
['serial_no', 'date', 'user_id', 'product_id', 'quantity_purchased', 'price', 'user_type']

### Sort Rows on defined attributes

In [114]:
# .. type your code here

display(df.sort_values(['serial_no','price'],ascending = [True, False]).head())


# first sorted on serial_no, all products having same serial_no sorted on price

,serial_no,date,user_id,product_id,quantity_purchased,price,user_type
647,-1,2016-01-20,5453,723,10,5906.17,b
602,-1,2016-01-28,5821,164,18,5881.15,c
994,-1,2016-01-14,5698,864,32,5456.67,d
281,-1,2016-01-21,5864,1068,24,5361.45,a
542,-1,2016-09-01,5169,1083,9,4279.55,c

### Rearrange Columns in a Dataframe

In [115]:
# .. type your code here

display(df[['serial_no','date','user_id','user_type','product_id','quantity_purchased','price']].head())

df=df[['serial_no','date','user_id','user_type','product_id','quantity_purchased','price']]
df.head()

   serial_no date  user_id user_type  product_id  quantity_purchased    price
0       1000  NaN     -101         n           0                  36  1777.80
1       1001  NaN     5975         n         625                   2  1283.34
2       1002  NaN     5821         n         164                  30  2211.46
3       1003  NaN     5838         n         629                   5  1508.19
4       1004  NaN     5771         n         408                   1   904.19

   serial_no date  user_id user_type  product_id  quantity_purchased    price
0       1000  NaN     -101         n           0                  36  1777.80
1       1001  NaN     5975         n         625                   2  1283.34
2       1002  NaN     5821         n         164                  30  2211.46
3       1003  NaN     5838         n         629                   5  1508.19
4       1004  NaN     5771         n         408                   1   904.19

### Filtering Columns

Using Column Index

In [116]:
# print 10 values from column at index 3
print(df.iloc[:,4].values[0:10])# it displays product_id
df['product_id'].head()

[  0 625 164 629 408 471 437 783 845 228]

0      0
1    625
2    164
3    629
4    408
Name: product_id, dtype: int64

Using Column Name

In [117]:
# print 10 values of quantity purchased
print(df.quantity_purchased.values[0:10])

[36  2 30  5  1 35 29 39 12 14]

Using Column Datatype

In [118]:
# print 10 values of columns with data type float
print(df.select_dtypes(include=['float64']).values[:10,0])#values[:10,0]<<------it is 0 bcz there is only 1 float value which is at 0th location in the dataframe
# we are printing only 0th column, i.e price
#we will get indexing error if we try to change 0th value

[1777.8  1283.34 2211.46 1508.19  904.19  666.55 2014.66 4434.27 2185.39
 2438.27]

### Filtering Rows

Select specific rows

In [119]:
display(df.iloc[[10,501,20]]) # i -> implicit indexing

,serial_no,date,user_id,user_type,product_id,quantity_purchased,price
10,-1,2016-01-13,5646,n,1038,33,2088.76
501,1501,2016-01-20,5975,a,625,19,4310.30
20,1020,NaN,5226,n,143,9,2590.79

Exclude Specific Row indices

In [120]:
df.drop([0,2,5], axis=0).head()
# note : axis=1 would give error as, indexes 0,2,5 don't appear column wise
# default axis is 0

   serial_no date  user_id user_type  product_id  quantity_purchased    price
1       1001  NaN     5975         n         625                   2  1283.34
3       1003  NaN     5838         n         629                   5  1508.19
4       1004  NaN     5771         n         408                   1   904.19
6       1006  NaN     5259         n         437                  29  2014.66
7       1007  NaN     5399         n         783                  39  4434.27

Conditional Filtering

In [121]:
display(df[df.quantity_purchased>25].head())

   serial_no date  user_id user_type  product_id  quantity_purchased    price
0       1000  NaN     -101         n           0                  36  1777.80
2       1002  NaN     5821         n         164                  30  2211.46
5       1005  NaN     5804         n         471                  35   666.55
6       1006  NaN     5259         n         437                  29  2014.66
7       1007  NaN     5399         n         783                  39  4434.27

Offset from top of the dataframe

In [122]:
display(df[100:].head())

,serial_no,date,user_id,user_type,product_id,quantity_purchased,price
100,1100,2016-01-27,5373,a,446,23,3034.47
101,1101,NaN,5975,b,625,20,4506.91
102,1102,2016-02-02,5821,b,164,41,NaN
103,1103,2016-04-02,5838,d,629,3,3524.09
104,1104,2016-09-02,5771,c,408,19,929.57

Offset from bottom of the dataframe

In [123]:
display(df[-10:].head()) # 1000th row is the last row - 10 = 990

,serial_no,date,user_id,user_type,product_id,quantity_purchased,price
990,1990,2016-10-02,5304,d,155,14,3742.65
991,1991,2016-01-02,5213,a,959,26,1874.39
992,1992,2016-05-01,5915,d,651,7,2468.13
993,1993,2016-08-02,5424,a,858,36,1214.94
994,-1,2016-01-14,5698,d,864,32,5456.67

### TypeCasting/Data Type Conversion

In [124]:
df['date'] = pd.to_datetime(df.date) #available in pandas
# compare dtypes of the original df with this one
print(df.dtypes)

serial_no                      int32
date                  datetime64[ns]
user_id                        int64
user_type                     object
product_id                     int64
quantity_purchased             int32
price                        float64
dtype: object

### Apply/Map Usage

Map : Create a derived attribute using map. map() works element wise.

In [125]:
df['user_class'] = df['user_type'].map(expand_user_type)
# map function applies the user defn method expand_user_type to each value of 
# user_type
display(df.tail())

# -- expand_user_type function is defn in the Utilities. 
# -- Its body is shown here just for reference.
#  def expand_user_type(u_type):
#   if u_type in ['a','b']:
#   return 'new'
#   elif u_type == 'c':
#   return 'existing'
#   elif u_type == 'd':
#   return 'loyal_existing'
#   else:
#   return 'error'

,serial_no,date,user_id,user_type,product_id,quantity_purchased,price,user_class
995,1995,2016-01-29,5883,c,517,4,2542.61,existing
996,1996,2016-01-13,5566,d,344,37,4041.02,loyal_existing
997,1997,2016-01-18,5062,d,1088,38,1802.28,loyal_existing
998,1998,2016-01-29,5928,c,562,28,NaN,existing
999,1999,2016-01-29,5955,d,1083,35,8187.02,loyal_existing

Apply: Using apply to get attribute ranges

In [126]:
# The apply() function is used to perform actions on the whole object, 
# depending upon the axis (default is on all rows).
display(df.select_dtypes(include=[np.number]).apply(lambda x: 
                                                        x.max()- x.min()))

serial_no             2000.00
user_id               6096.00
product_id            1098.00
quantity_purchased      40.00
price                 8655.63
dtype: float64

Applymap: Extract week from date

In [127]:
df['purchase_week'] = df[['date']].applymap(lambda dt:dt.week 
                                                if not pd.isnull(dt.week) 
                                                else 0)

# lambda fn gets the week of the transaction from the date attribute

# if not pd.isnull(dt.week) ->dt.week==>NAN
#                             therefor if not isnull(dt.week)=>isnull(dt.week)==>true
#                             if not true ===>false
#                             will goto else and purchase week=0
# to print week from the date
# df['date'].dt.week
# df.date.dt.week

In [128]:
 display(df.head()) # display() is defined under Utilities

,serial_no,date,user_id,user_type,product_id,quantity_purchased,price,user_class,purchase_week
0,1000,NaT,-101,n,0,36,1777.80,error,0
1,1001,NaT,5975,n,625,2,1283.34,error,0
2,1002,NaT,5821,n,164,30,2211.46,error,0
3,1003,NaT,5838,n,629,5,1508.19,error,0
4,1004,NaT,5771,n,408,1,904.19,error,0

### Missing Values

Imputing Missing Values : Missing values can lead to all sorts of problems when dealing with Machine Learning and Data Science related use cases. Not only can they cause problems for algorithms, they can mess up calculations and even final outcomes. 

Missing values also pose risk of being interpreted in non-standard ways as well leading to confusion and more errors. Hence, imputing missing values carries a lot of weight in the overall data wrangling process.

One of the easiest ways of handling missing values is to ignore or remove them altogether from the dataset. When the dataset is fairly large and we have enough samples of various types required, this option can be safely exercised. We use the dropna() function from pandas in the following snippet to remove rows of data where the date of transaction is missing.

In [129]:
print("Drop Rows with missing dates::" )
df_dropped = df.dropna(subset=['date'])
display(df_dropped.head())

# # dropna -> drops not available values

Drop Rows with missing dates::

,serial_no,date,user_id,user_type,product_id,quantity_purchased,price,user_class,purchase_week
9,1009,2016-01-18,5002,n,228,14,2438.27,error,3
10,-1,2016-01-13,5646,n,1038,33,2088.76,error,2
11,1011,2016-01-01,5782,n,585,4,196.70,error,53
12,1012,2016-11-01,5059,n,947,35,6403.20,error,44
14,1014,2016-01-18,5573,n,423,17,7088.03,error,3

Fill Missing Price values with mean price

In [130]:
df_dropped.shape[0]

969

In [131]:
# Often dropping rows is a very expensive and unfeasible option. 
# In many scenarios, missing values are imputed using the help of other 
# values in the dataframe. One commonly used trick is to replace missing
# values with a central tendency measure like mean or median.
# fillna -> fills not available values
df_dropped['price'].fillna(value=np.round(df.price.mean(),decimals=2),
                                inplace=True)
df_dropped['price'].head()

9     2438.27
10    2088.76
11     196.70
12    6403.20
14    7088.03
Name: price, dtype: float64

Fill Missing user_type values with value from previous row (forward fill)

In [132]:
print("Fill Missing user_type values with value from previous row (forward fill) ::" )
df_dropped['user_type'].fillna(method='ffill',inplace=True)
df_dropped.head()

Fill Missing user_type values with value from previous row (forward fill) ::

,serial_no,date,user_id,user_type,product_id,quantity_purchased,price,user_class,purchase_week
9,1009,2016-01-18,5002,n,228,14,2438.27,error,3
10,-1,2016-01-13,5646,n,1038,33,2088.76,error,2
11,1011,2016-01-01,5782,n,585,4,196.70,error,53
12,1012,2016-11-01,5059,n,947,35,6403.20,error,44
14,1014,2016-01-18,5573,n,423,17,7088.03,error,3

Fill Missing user_type values with value from next row (backward fill)

In [133]:
df_dropped['user_type'].fillna(method='bfill',inplace=True)
# keeping inplace true writes the new data in the data set itself.


# try to figure out : what would happen if we keep

inplace = True
df-> changes copies to orginal 
thereby new data space not consumed
___________________________________

inplace = False
df-----> changes not copied to orginal
thereby new data space create

// here do this kind if coding
dfNew = df.fillna(....,inplace=False)
_____________________________________

### Duplicates

Drop Duplicate serial_no rows

In [134]:
# sample duplicates
# duplicated is a build-in fn
print(df_dropped[df_dropped.duplicated(subset=['serial_no'])].head())
print("Shape of df={}".format(df_dropped.shape))

     serial_no       date  user_id user_type  product_id  quantity_purchased  \
22          -1 2016-05-01     5368         n         882                  34
119         -1 2016-01-15     5627         d         197                  12
136         -1 2016-01-02     5715         a         284                   7
258         -1 2016-01-29     5384         d         391                   8
281         -1 2016-01-21     5864         a        1068                  24

       price      user_class  purchase_week
22   2610.57           error             17
119   687.15  loyal_existing              2
136   597.20             new             53
258   971.35  loyal_existing              4
281  5361.45             new              3
Shape of df=(969, 9)

In [135]:
# drop_duplicates is a build-in function 
df_dropped.drop_duplicates(subset=['serial_no'],inplace=True)

In [136]:
# updated dataframe
print(df_dropped.head())
print("Shape of df={}".format(df_dropped.shape))

    serial_no       date  user_id user_type  product_id  quantity_purchased  \
9        1009 2016-01-18     5002         n         228                  14
10         -1 2016-01-13     5646         n        1038                  33
11       1011 2016-01-01     5782         n         585                   4
12       1012 2016-11-01     5059         n         947                  35
14       1014 2016-01-18     5573         n         423                  17

      price user_class  purchase_week
9   2438.27      error              3
10  2088.76      error              2
11   196.70      error             53
12  6403.20      error             44
14  7088.03      error              3
Shape of df=(943, 9)

Remove rows which have less than 3 attributes with non-missing data

In [137]:
# there are certain conditions where a record is not much of use 
# if it has more than a certain threshold of attribute values missing. 
# For instance, if in our dataset a transaction has less than three
# attributes as non-null, the transaction might almost be unusable. 
# In such a scenario, it might be advisable to drop that data point itself. 
# We can filter out such data points using the function dropna() 
# with the parameter thresh set to the threshold of non-null attributes

display(df.dropna(thresh=3).head())#<<<<--------------thresh=3 means there are atleast 3 values in dataframe
print("Shape of df={}".format(df.dropna(thresh=3).shape))

,serial_no,date,user_id,user_type,product_id,quantity_purchased,price,user_class,purchase_week
0,1000,NaT,-101,n,0,36,1777.80,error,0
1,1001,NaT,5975,n,625,2,1283.34,error,0
2,1002,NaT,5821,n,164,30,2211.46,error,0
3,1003,NaT,5838,n,629,5,1508.19,error,0
4,1004,NaT,5771,n,408,1,904.19,error,0

Shape of df=(1000, 9)

### Encode Categoricals

One Hot Encoding using get_dummies()

In [138]:
# method to convert the categorical variable into indicator variables 
# use the get_dummies() function.
display(pd.get_dummies(df,columns=['user_type']).head())

,serial_no,date,user_id,product_id,quantity_purchased,price,user_class,purchase_week,user_type_a,user_type_b,user_type_c,user_type_d,user_type_n
0,1000,NaT,-101,0,36,1777.80,error,0,0,0,0,0,1
1,1001,NaT,5975,625,2,1283.34,error,0,0,0,0,0,1
2,1002,NaT,5821,164,30,2211.46,error,0,0,0,0,0,1
3,1003,NaT,5838,629,5,1508.19,error,0,0,0,0,0,1
4,1004,NaT,5771,408,1,904.19,error,0,0,0,0,0,1

Label Mapping

In [139]:
# using the map() function, where we simply map each value 
# from the allowed set to a numeric value
type_map={'a':0,'b':1,'c':2,'d':3,np.NAN:-1}
df['encoded_user_type'] = df.user_type.map(type_map)
display((df.tail()))

,serial_no,date,user_id,user_type,product_id,quantity_purchased,price,user_class,purchase_week,encoded_user_type
995,1995,2016-01-29,5883,c,517,4,2542.61,existing,4,2.0
996,1996,2016-01-13,5566,d,344,37,4041.02,loyal_existing,2,3.0
997,1997,2016-01-18,5062,d,1088,38,1802.28,loyal_existing,3,3.0
998,1998,2016-01-29,5928,c,562,28,NaN,existing,4,2.0
999,1999,2016-01-29,5955,d,1083,35,8187.02,loyal_existing,4,3.0

### Random Sampling data from DataFrame

In [140]:
display(df.sample(frac=0.2, replace=True, random_state=42).head())
# explaination for replace parameter
# when sampling the records are removed from the orginal dataset, so that
# their is no repetition of samples in the o/p.
# but if the size of the sample is greater than the dataset itself then keep
# replace = true

,serial_no,date,user_id,user_type,product_id,quantity_purchased,price,user_class,purchase_week,encoded_user_type
102,1102,2016-02-02,5821,b,164,41,NaN,new,5,1.0
435,1435,2016-01-28,5520,a,813,34,NaN,new,4,0.0
860,1860,2016-06-02,5026,d,775,2,1177.42,loyal_existing,22,3.0
270,1270,2016-01-14,5364,c,271,25,1168.55,existing,2,2.0
106,1106,2016-07-01,5259,c,437,6,5631.92,existing,26,2.0

### Normalizing Numeric Values

Attribute normalization is the process of standardizing the range of values of attributes. Machine learning algorithms in many cases utilize distance metrics, attributes or features of different scales/ranges which might adversely affect the calculations or bias the outcomes. Normalization is also called feature scaling.

Normalize price values using  **Min-Max Scaler**

In [142]:
df_normalized = df.dropna().copy()
min_max_scaler = preprocessing.MinMaxScaler()
np_scaled = min_max_scaler.fit_transform(df_normalized['price'].values.reshape(-1,1))
print(np_scaled)
df_normalized['price'] = np_scaled

# fit doesnt need reshape but transfrom does
# reshape(-1,1) works like this :
# -1 means we dont know the no. of rows. hence it would take len(df).
# the 2nd parameter being 1 -> means I want only 1 column
# ex: assume z is 2D numpy array and z.shape is (3,4) 
# z.reshape(-1) would give you a 1D np.array
# now z.shape would be (12,)  like 
# array([1,2,3,4,5,6,7,8,9,10,11,12])
# and reshaping it as z.reshape(-1,1) would give us (12,1). 
# i.e 1 column with all row values.

[[1.53994568e-01]
 [2.28505608e-01]
 [1.22267241e-01]
 [3.32853877e-01]
 [1.76288728e-01]
 [9.43362875e-02]
 [6.30524872e-01]
 [9.00616131e-02]
 [2.64223401e-01]
 [7.81791736e-02]
 [2.46891330e-03]
 [7.82034352e-03]
 [6.62500592e-01]
 [3.98472439e-01]
 [3.61303568e-01]
 [3.33578261e-01]
 [2.38991269e-01]
 [9.80275266e-02]
 [2.17305962e-01]
 [2.63198635e-01]
 [1.82923716e-01]
 [1.99879154e-01]
 [5.68704993e-02]
 [2.08645702e-01]
 [3.69168969e-01]
 [1.22459024e-01]
 [2.94131103e-01]
 [2.69708848e-02]
 [2.29922028e-01]
 [2.15725487e-01]
 [1.96616537e-01]
 [3.37556018e-01]
 [2.04335213e-01]
 [8.58516364e-03]
 [2.93246130e-01]
 [1.13823026e-01]
 [4.06044390e-01]
 [1.73630342e-01]
 [3.11470107e-01]
 [4.21433217e-01]
 [3.87068301e-01]
 [1.06318084e-01]
 [4.90386026e-02]
 [2.73427815e-01]
 [4.12214940e-01]
 [3.27128124e-01]
 [1.67309601e-01]
 [4.87907870e-01]
 [1.00141757e-01]
 [4.46152389e-01]
 [3.94744230e-01]
 [2.09193323e-02]
 [2.71638229e-01]
 [5.45414950e-01]
 [3.56854440e-01]
 [1.12386967e-01]
 [9.34166548e-02]
 [1.53717292e-01]
 [3.50017272e-01]
 [4.06583923e-01]
 [1.06834511e-01]
 [6.21501843e-01]
 [6.50105192e-01]
 [2.33444590e-01]
 [4.05018468e-01]
 [5.58874397e-01]
 [9.20464484e-02]
 [3.39546630e-01]
 [1.13471810e-01]
 [2.62699538e-01]
 [2.62285934e-01]
 [3.00662112e-01]
 [2.96603482e-01]
 [4.65200107e-01]
 [7.88273066e-02]
 [4.93843891e-01]
 [3.98995798e-01]
 [3.49838198e-01]
 [6.13547483e-01]
 [2.37545967e-01]
 [9.95479243e-02]
 [7.60701416e-01]
 [6.72394730e-03]
 [3.10384108e-01]
 [1.98820883e-01]
 [1.13241902e-01]
 [1.79322591e-01]
 [2.06473706e-01]
 [6.84352266e-02]
 [2.94228150e-01]
 [6.06481562e-01]
 [2.41904980e-01]
 [2.78449980e-01]
 [1.75944443e-01]
 [2.61463348e-01]
 [1.90577693e-01]
 [3.59798189e-01]
 [1.47975364e-01]
 [1.62505791e-01]
 [5.39943366e-01]
 [2.60794419e-01]
 [2.76636132e-01]
 [1.66399211e-01]
 [1.12816745e-01]
 [5.25981355e-02]
 [3.58793063e-01]
 [3.62145794e-02]
 [6.82876925e-01]
 [6.28492669e-03]
 [2.53997687e-01]
 [2.33967949e-01]
 [8.08976354e-02]
 [1.26998266e-01]
 [2.04268205e-01]
 [2.20038287e-01]
 [8.73073364e-02]
 [4.76799494e-01]
 [3.17483534e-01]
 [1.63468170e-01]
 [4.46042634e-01]
 [4.99961297e-01]
 [1.31222106e-01]
 [3.55293607e-01]
 [2.89393146e-01]
 [4.10644864e-01]
 [1.87369377e-02]
 [4.05509478e-01]
 [2.47489784e-01]
 [1.90526859e-01]
 [3.38662813e-01]
 [5.22513093e-01]
 [1.88113401e-01]
 [1.23346308e-01]
 [1.93677410e-02]
 [3.64329344e-01]
 [1.29494907e-01]
 [2.67287303e-01]
 [2.76302245e-01]
 [1.15678466e-01]
 [4.51740659e-01]
 [4.35496896e-01]
 [1.98229361e-01]
 [3.75697667e-02]
 [6.04700062e-01]
 [3.84245861e-01]
 [1.43110322e-01]
 [1.92562529e-01]
 [2.82714257e-01]
 [3.12779081e-02]
 [1.60700030e-01]
 [1.54177108e-02]
 [2.64139063e-01]
 [1.74160633e-01]
 [7.22870548e-02]
 [3.05028057e-01]
 [2.26267759e-01]
 [2.78870515e-01]
 [2.41103189e-01]
 [3.86804889e-01]
 [3.06834973e-01]
 [3.48779927e-01]
 [1.73629187e-01]
 [7.98208796e-03]
 [1.73500947e-01]
 [3.56089620e-01]
 [5.37853397e-01]
 [2.38594995e-01]
 [2.72206645e-01]
 [4.58020964e-01]
 [2.40599471e-01]
 [1.95223225e-01]
 [5.49503618e-02]
 [5.97482794e-01]
 [3.35319324e-02]
 [2.60630364e-01]
 [3.16397535e-01]
 [5.04041878e-02]
 [1.70535247e-01]
 [3.13683695e-01]
 [1.48700903e-01]
 [1.03374336e-01]
 [1.49178049e-01]
 [6.75525641e-02]
 [2.37610665e-01]
 [2.93753314e-01]
 [1.29474111e-01]
 [1.44723146e-01]
 [2.19849970e-01]
 [1.92584480e-01]
 [3.94544360e-01]
 [7.25875528e-01]
 [1.98149644e-01]
 [1.68285844e-01]
 [1.92516316e-01]
 [3.26109134e-01]
 [6.19354108e-02]
 [4.11209814e-01]
 [4.76164069e-02]
 [2.17204294e-01]
 [2.86562619e-01]
 [2.91614822e-01]
 [1.91886668e-02]
 [1.27172719e-01]
 [2.51821069e-01]
 [1.20923607e-01]
 [1.11661427e-01]
 [2.32415203e-02]
 [2.52425300e-02]
 [2.30901737e-01]
 [2.93586949e-01]
 [4.82212156e-01]
 [1.84378260e-01]
 [2.54077404e-02]
 [2.63077327e-01]
 [4.99887357e-01]
 [2.94129948e-01]
 [4.68282494e-01]
 [1.34444287e-01]
 [2.95545212e-01]
 [1.28892986e-01]
 [6.61061067e-02]
 [9.38233266e-03]
 [5.34161003e-02]
 [4.96597013e-01]
 [4.18754036e-01]
 [3.30698054e-02]
 [2.58677878e-01]
 [2.71870447e-01]
 [6.18857322e-01]
 [2.10875465e-01]
 [1.68635905e-01]
 [2.12924998e-03]
 [5.08002306e-01]
 [4.15471780e-01]
 [2.50963824e-01]
 [2.69206285e-01]
 [3.30826295e-01]
 [1.15515566e-01]
 [4.72721223e-01]
 [1.67392784e-01]
 [3.34557970e-01]
 [8.86290195e-02]
 [1.11506615e-01]
 [3.91284054e-01]
 [3.15088561e-01]
 [3.68005564e-01]
 [7.07187114e-01]
 [2.24093451e-01]
 [2.05985006e-01]
 [7.43550729e-02]
 [1.88305184e-02]
 [2.89510989e-02]
 [9.78080163e-02]
 [2.32565394e-02]
 [2.07771127e-01]
 [6.63036659e-02]
 [3.25836479e-01]
 [1.59447666e-01]
 [4.99012781e-01]
 [3.11515164e-01]
 [3.71128387e-01]
 [6.88620008e-01]
 [2.63787847e-01]
 [3.22102493e-02]
 [1.65711797e-01]
 [1.60066916e-01]
 [3.22633939e-01]
 [4.42255503e-03]
 [4.72363075e-02]
 [2.39639402e-01]
 [1.18351870e-01]
 [1.15762804e-02]
 [2.04352543e-02]
 [4.58440345e-01]
 [2.84786896e-01]
 [1.69835125e-01]
 [1.47702709e-01]
 [1.75488093e-01]
 [2.89165549e-01]
 [4.30010294e-01]
 [3.53945351e-01]
 [8.83713837e-02]
 [1.69658361e-01]
 [4.81374550e-02]
 [4.43944577e-01]
 [6.39433525e-01]
 [2.38867650e-01]
 [1.30698748e-01]
 [2.45972852e-01]
 [1.48673176e-01]
 [5.61880533e-01]
 [2.58618957e-01]
 [3.18239111e-01]
 [4.31107845e-01]
 [5.29240506e-01]
 [7.67857452e-01]
 [2.29908164e-01]
 [6.72362381e-01]
 [5.80812720e-02]
 [8.56263496e-02]
 [3.96937022e-01]
 [9.79351012e-02]
 [1.19906928e-01]
 [6.53528397e-02]
 [3.04137307e-01]
 [1.96792146e-01]
 [2.41989318e-01]
 [1.24057983e-01]
 [1.95874824e-01]
 [6.20832915e-02]
 [2.14146168e-01]
 [0.00000000e+00]
 [5.80858932e-02]
 [3.72745831e-01]
 [5.23436191e-01]
 [8.07682399e-02]
 [5.39877513e-01]
 [4.54051294e-01]
 [3.58991778e-02]
 [4.78185874e-02]
 [2.13705993e-01]
 [2.42471085e-01]
 [1.63048790e-01]
 [1.25845259e-01]
 [3.34724335e-01]
 [1.41165923e-01]
 [3.46701511e-01]
 [3.92425508e-01]
 [3.68905556e-01]
 [6.07441630e-01]
 [2.11408066e-01]
 [6.47127939e-02]
 [4.14304909e-01]
 [3.83911974e-02]
 [2.47942669e-02]
 [4.34384326e-01]
 [1.11935238e-01]
 [1.11597885e-01]
 [2.59550143e-01]
 [3.06004300e-01]
 [2.27538608e-01]
 [2.16206099e-02]
 [6.70576261e-01]
 [2.61552308e-01]
 [4.51072886e-01]
 [6.29851322e-01]
 [2.90737936e-01]
 [1.88203516e-01]
 [1.59326358e-01]
 [4.10209309e-01]
 [6.40288460e-02]
 [1.45678593e-01]
 [6.11162908e-02]
 [1.81038238e-02]
 [3.80053214e-02]
 [2.54854933e-01]
 [3.15879953e-01]
 [1.29754853e-01]
 [4.16029798e-03]
 [1.98125382e-02]
 [3.72026069e-01]
 [4.03830801e-01]
 [1.62079479e-01]
 [3.19341284e-01]
 [2.36762662e-01]
 [4.55411102e-01]
 [8.16289513e-02]
 [1.73540228e-01]
 [2.59599821e-03]
 [3.40440846e-01]
 [2.28036550e-01]
 [1.92760088e-01]
 [1.17198864e-01]
 [5.21637362e-02]
 [1.15930325e-01]
 [2.78954854e-01]
 [6.89562747e-02]
 [2.15966949e-01]
 [6.32723441e-01]
 [2.89919971e-01]
 [2.58533463e-01]
 [4.27347287e-01]
 [5.98454416e-04]
 [5.73020104e-01]
 [1.08977625e-01]
 [1.86728176e-01]
 [5.11933851e-01]
 [5.04559460e-01]
 [2.22668945e-01]
 [1.09156699e-01]
 [3.05435884e-01]
 [8.94845320e-01]
 [4.61025945e-01]
 [3.41050854e-01]
 [4.31688970e-01]
 [2.69510134e-01]
 [1.20147234e-01]
 [2.09965075e-01]
 [4.11328811e-01]
 [3.86338141e-03]
 [5.21460598e-01]
 [4.13430334e-02]
 [4.34234134e-01]
 [6.21009678e-01]
 [4.24514449e-01]
 [5.14908793e-01]
 [1.01979867e-02]
 [7.24210716e-02]
 [2.81140714e-01]
 [5.23742350e-01]
 [3.77208822e-01]
 [9.61697762e-02]
 [3.12613871e-01]
 [2.82678442e-01]
 [2.28741293e-02]
 [1.09064274e-01]
 [2.97794615e-01]
 [4.53716252e-02]
 [2.60210984e-01]
 [6.64914050e-01]
 [1.11779270e-01]
 [3.60849528e-01]
 [6.51899400e-02]
 [5.04235971e-01]
 [7.24362063e-01]
 [5.38734904e-01]
 [1.87480287e-01]
 [4.71600565e-02]
 [3.46118076e-01]
 [3.43146599e-01]
 [5.47403251e-01]
 [9.69045581e-02]
 [3.15913457e-01]
 [2.95547522e-01]
 [2.49571666e-02]
 [3.99437129e-01]
 [4.79641574e-02]
 [2.60963096e-01]
 [2.55151849e-02]
 [4.97416133e-01]
 [3.88027215e-01]
 [9.55955835e-02]
 [1.23469927e-01]
 [3.83891178e-01]
 [3.76603436e-01]
 [4.51297017e-01]
 [2.53000648e-01]
 [5.11002665e-01]
 [2.36821583e-01]
 [1.02751619e-01]
 [3.54147532e-01]
 [1.46619021e-01]
 [4.65934889e-01]
 [4.27573729e-01]
 [9.79385672e-02]
 [5.17769359e-01]
 [3.03255800e-01]
 [9.32144743e-02]
 [3.64945128e-01]
 [3.87031331e-02]
 [7.93009868e-03]
 [2.38149043e-01]
 [3.34221772e-02]
 [2.62019056e-01]
 [3.20431904e-01]
 [6.48847051e-01]
 [1.50625662e-01]
 [1.86772078e-01]
 [4.30510546e-01]
 [8.10374288e-02]
 [2.73232567e-02]
 [4.74338667e-02]
 [3.55509651e-01]
 [1.69249379e-01]
 [4.56500567e-02]
 [2.56457358e-01]
 [2.17565908e-01]
 [1.61214146e-01]
 [4.93863532e-01]
 [2.35588860e-01]
 [3.15841828e-01]
 [1.06626554e-01]
 [2.58346302e-01]
 [3.03790712e-01]
 [2.69798963e-01]
 [2.70956591e-01]
 [5.26048364e-01]
 [1.93269583e-01]
 [8.67088820e-02]
 [6.81059611e-03]
 [2.76897233e-01]
 [5.11799834e-01]
 [1.80863785e-01]
 [6.04340759e-01]
 [4.85441268e-02]
 [5.75279905e-01]
 [3.96857306e-01]
 [1.27579391e-01]
 [5.01093508e-01]
 [1.14245872e-01]
 [1.08738474e-02]
 [6.16662219e-02]
 [3.13958660e-01]
 [1.77962783e-01]
 [4.29958305e-01]
 [3.17668385e-01]
 [1.97861970e-01]
 [4.14540594e-01]
 [3.05368876e-01]
 [1.92979598e-01]
 [2.05576024e-01]
 [1.76507083e-01]
 [4.97323707e-01]
 [1.42113283e-01]
 [1.86098528e-01]
 [2.42174169e-01]
 [1.92475880e-02]
 [4.13489255e-01]
 [1.07417946e-01]
 [1.48269970e-01]
 [2.16470667e-01]
 [6.49417778e-01]
 [3.64481846e-01]
 [1.64937734e-01]
 [8.31978724e-02]
 [3.64831907e-01]
 [9.76350653e-01]
 [1.64159050e-01]
 [1.25681204e-01]
 [4.52907530e-01]
 [1.85428444e-03]
 [4.81500480e-01]
 [3.05865662e-01]
 [4.46241348e-02]
 [1.56591721e-02]
 [1.27014440e-01]
 [3.53016476e-01]
 [6.78899167e-01]
 [2.18604538e-01]
 [6.50039339e-02]
 [8.48395784e-02]
 [6.83086038e-01]
 [4.44563827e-01]
 [2.62300953e-01]
 [3.07324828e-01]
 [1.38546819e-01]
 [1.74345484e-01]
 [1.04751474e-01]
 [2.32207245e-02]
 [2.48000434e-01]
 [5.81406553e-01]
 [1.70977734e-01]
 [3.44007311e-02]
 [7.73012479e-01]
 [4.00413373e-01]
 [1.43900560e-01]
 [1.02633777e-01]
 [3.66582213e-02]
 [1.03761367e-01]
 [1.83010364e-01]
 [2.77645879e-01]
 [6.25033649e-01]
 [1.86988122e-02]
 [5.53373931e-02]
 [5.30001860e-02]
 [3.41841091e-01]
 [4.52675311e-01]
 [1.54737437e-01]
 [1.95235933e-01]
 [2.47114306e-01]
 [3.92282249e-01]
 [4.29422237e-01]
 [3.12132104e-02]
 [5.00095314e-01]
 [8.64269845e-02]
 [3.83600038e-02]
 [3.64782228e-01]
 [1.04535430e-01]
 [2.69420019e-02]
 [1.02810541e-01]
 [1.44587973e-02]
 [1.12281833e-01]
 [6.81789772e-01]
 [2.90309313e-01]
 [5.74486201e-01]
 [1.40688777e-01]
 [6.70211180e-02]
 [1.25763232e-01]
 [6.31100220e-01]
 [6.15204208e-01]
 [5.04529422e-01]
 [3.52359100e-01]
 [5.17133935e-01]
 [2.61121374e-01]
 [4.21188290e-01]
 [1.08367617e-01]
 [8.51515141e-02]
 [8.84164411e-03]
 [1.02920296e-01]
 [2.00583897e-01]
 [1.74785660e-01]
 [4.42042925e-01]
 [5.27827553e-01]
 [3.97445362e-01]
 [5.18349329e-01]
 [1.12337288e-01]
 [6.05455640e-02]
 [3.51654357e-01]
 [3.92314598e-01]
 [1.05131573e-01]
 [3.29110648e-01]
 [8.79081014e-02]
 [1.73422385e-01]
 [2.97099114e-01]
 [1.74248437e-01]
 [5.16238564e-01]
 [2.69975727e-01]
 [1.91868183e-01]
 [3.65791976e-01]
 [9.00223323e-03]
 [4.69081973e-02]
 [1.00981673e-01]
 [8.72149110e-02]
 [3.95744735e-01]
 [3.67425595e-02]
 [2.34724682e-01]
 [1.50694981e-01]
 [1.52675195e-01]
 [9.94901584e-02]
 [5.33823650e-01]
 [5.73349369e-02]
 [2.64679752e-01]
 [6.19642938e-02]
 [2.12557607e-01]
 [3.60816024e-01]
 [1.54197904e-01]
 [1.64972394e-01]
 [2.77513018e-01]
 [3.93354383e-01]
 [1.92187051e-01]
 [2.56921795e-01]
 [3.33649890e-01]
 [4.07319860e-01]
 [6.87887537e-02]
 [2.22983191e-01]
 [5.53594597e-01]
 [4.05957741e-01]
 [2.66754702e-01]
 [1.74868843e-01]
 [2.83201800e-01]
 [3.57002321e-01]
 [2.32715585e-02]
 [6.46474029e-01]
 [9.06092335e-02]
 [4.17998459e-01]
 [1.09021527e-01]
 [3.88536710e-01]
 [3.54335848e-02]
 [4.02290763e-01]
 [4.74855094e-01]
 [2.07630178e-01]
 [2.04118013e-01]
 [5.17571800e-01]
 [2.31065792e-01]
 [5.57672867e-01]
 [4.46798211e-01]
 [6.93513933e-02]
 [1.64149808e-01]
 [1.29641632e-01]
 [8.44305960e-03]
 [3.43742743e-01]
 [1.06333103e-01]
 [1.13747931e-01]
 [2.55802293e-01]
 [3.29590105e-01]
 [3.76437070e-01]
 [5.33235593e-01]
 [8.46616595e-03]
 [4.97001374e-01]
 [3.20821246e-01]
 [1.80275728e-01]
 [5.68120403e-01]
 [2.56257488e-01]
 [3.41039300e-01]
 [1.62850076e-01]
 [4.30991158e-02]
 [4.55912510e-01]
 [3.17336809e-01]
 [4.21592651e-01]
 [1.00928529e-01]
 [2.45150266e-01]
 [3.90044399e-01]
 [1.07740280e-01]
 [4.94833998e-02]
 [1.95986889e-01]
 [1.37721922e-01]
 [1.07558895e-01]
 [4.53182495e-01]
 [3.56088465e-01]
 [6.93190444e-02]
 [2.78770003e-01]
 [2.85394593e-01]
 [1.08004848e-01]
 [1.43685670e-01]
 [2.47447037e-01]
 [7.92998314e-02]
 [1.74719807e-01]
 [2.41612684e-01]
 [6.59039261e-02]
 [1.10978635e-01]
 [1.24855152e-02]
 [5.35464201e-01]
 [4.25578496e-01]
 [4.95134381e-01]
 [5.72902261e-01]
 [7.32228619e-02]
 [4.92494480e-01]
 [1.03735950e-02]
 [5.06225428e-01]
 [4.39450392e-01]
 [1.70226777e-01]
 [4.90032499e-01]
 [3.11323381e-02]
 [3.55129552e-01]
 [3.59348771e-01]
 [2.30477735e-01]
 [4.38523828e-02]
 [1.36700621e-01]
 [1.23601633e-01]
 [2.67890379e-01]
 [4.28187203e-01]
 [2.72247081e-01]
 [6.97557543e-02]
 [9.04035870e-02]
 [4.13040992e-01]
 [5.18639313e-01]
 [7.90641467e-02]
 [3.58106804e-01]
 [5.90459620e-02]
 [1.20758397e-01]
 [1.95583684e-01]
 [2.24734652e-01]
 [3.85315685e-01]
 [8.50486909e-02]
 [1.87645498e-01]
 [1.48570352e-01]
 [5.98444019e-01]
 [1.36806911e-01]
 [1.01944053e-01]
 [2.38326962e-01]
 [7.01334276e-01]
 [9.87842595e-02]
 [7.27665115e-02]
 [1.42417132e-01]
 [8.26075052e-02]
 [8.60145362e-02]
 [7.53933567e-01]
 [7.27549583e-01]
 [9.05387592e-02]
 [1.87148711e-01]
 [1.39080575e-01]
 [1.82571344e-01]
 [3.23838935e-01]
 [1.42247300e-01]
 [3.57082038e-01]
 [7.40327394e-02]
 [2.21149703e-01]
 [1.49877016e-01]
 [5.40030015e-01]
 [3.87436847e-01]
 [3.67429061e-01]
 [3.43861741e-01]
 [3.27081911e-02]
 [2.91656413e-01]
 [2.87692519e-01]
 [4.91679982e-02]
 [2.71217693e-01]
 [1.19169835e-01]
 [8.02599002e-03]
 [4.36183155e-01]
 [8.11148351e-03]
 [2.53927213e-01]
 [2.43676081e-01]
 [3.45048252e-01]
 [1.49361745e-01]
 [1.28397355e-01]
 [1.62818882e-01]
 [5.06005918e-02]
 [7.69834200e-02]
 [3.06260781e-01]
 [1.35469053e-01]
 [3.37309936e-01]
 [1.94900891e-01]
 [1.15323783e-02]
 [7.28585903e-01]
 [1.50713466e-01]
 [1.10588137e-01]
 [2.49974872e-01]
 [7.83663350e-02]
 [2.30365670e-01]
 [1.82527442e-01]
 [5.82066239e-01]
 [6.03884408e-03]
 [2.87354011e-01]
 [4.16711435e-02]
 [7.83490052e-02]
 [4.40175932e-02]
 [3.20354498e-01]
 [2.64643937e-01]
 [2.36078714e-01]
 [1.39211126e-01]
 [2.32791836e-01]
 [1.18819774e-01]
 [7.11756394e-02]
 [4.74962539e-02]
 [6.32282110e-02]
 [1.00000000e+00]
 [4.11535613e-02]
 [3.80281967e-01]
 [3.20470029e-01]
 [2.58627044e-01]
 [5.60586578e-01]
 [4.80692913e-02]
 [1.92627226e-01]
 [1.10529216e-02]
 [2.74082880e-01]
 [4.21506002e-02]
 [1.77514519e-01]
 [4.37435519e-01]
 [5.95335059e-02]
 [6.45429622e-01]
 [3.51461419e-01]
 [4.27492857e-01]
 [4.26783492e-01]
 [1.17273959e-01]
 [1.59605944e-01]
 [2.90772595e-01]
 [5.68912950e-02]
 [2.14045656e-01]
 [9.28540152e-02]
 [7.25299025e-01]
 [4.62446985e-01]
 [1.69589042e-01]
 [3.29885866e-01]
 [8.22539780e-02]
 [1.02288337e-01]
 [2.10288564e-01]
 [2.09227982e-01]
 [1.90980899e-01]
 [3.40343799e-01]
 [9.84561494e-03]
 [2.96801042e-02]
 [4.58568585e-01]
 [1.33496926e-01]
 [3.33521650e-01]
 [1.91410677e-01]
 [1.40285571e-01]
 [2.95767033e-01]
 [4.53631914e-01]
 [5.61738429e-02]
 [9.27789196e-02]
 [1.54088148e-01]
 [5.78819797e-01]
 [1.26784532e-01]
 [1.12636515e-01]
 [1.92464327e-02]
 [3.17258247e-01]
 [2.98661103e-02]
 [5.34415173e-02]
 [4.56257950e-02]
 [7.38106874e-01]
 [2.07240836e-01]
 [3.45054028e-01]
 [4.17157388e-01]
 [3.39381420e-01]
 [1.68355163e-01]
 [6.51037533e-01]
 [1.73906463e-01]
 [2.34572180e-01]
 [2.96416321e-01]
 [3.21916487e-01]
 [5.80101044e-01]
 [3.36340625e-01]
 [4.28009284e-01]
 [4.29385267e-01]
 [3.14977650e-01]
 [2.68060211e-01]
 [7.78579953e-02]
 [3.16412555e-01]
 [1.27198136e-01]
 [4.87728796e-02]
 [9.71991640e-02]
 [6.12474193e-01]
 [2.60354243e-01]
 [1.78456103e-01]
 [6.97685784e-01]
 [1.19048527e-01]
 [1.29772183e-01]
 [1.68082508e-01]
 [5.63121344e-01]
 [2.36751109e-01]
 [4.80689447e-01]
 [2.43652975e-01]
 [2.62036386e-01]
 [5.06303989e-01]
 [2.82313361e-01]
 [3.96781055e-01]
 [4.65241698e-01]
 [2.52712974e-01]
 [1.26600837e-01]
 [1.45796435e-01]
 [3.94286724e-02]
 [1.47324920e-01]
 [3.23077581e-01]
 [1.83815621e-01]
 [4.31834540e-01]
 [2.15991210e-01]
 [2.84587026e-01]
 [1.39803804e-01]
 [6.29858254e-01]
 [2.93191830e-01]
 [4.66305746e-01]
 [2.07660217e-01]
 [9.45300342e-01]]

In [106]:
display(df_normalized.head())

,serial_no,date,user_id,user_type,product_id,quantity_purchased,price,user_class,purchase_week,encoded_user_type
15,1015,2016-01-23,5122,d,382,30,0.341733,loyal_existing,3,3.0
17,1017,2016-01-29,5596,d,243,39,0.436007,loyal_existing,4,3.0
20,1020,2016-12-01,5456,d,802,2,0.608235,loyal_existing,48,3.0
33,1033,2016-05-02,5908,d,624,9,0.664128,loyal_existing,18,3.0
34,1034,2016-01-17,5101,d,183,20,0.394531,loyal_existing,2,3.0

Normalize quantity purchased values using  **Robust Scaler**

In [145]:
df_normalized = df.dropna().copy()
robust_scaler = preprocessing.RobustScaler()
rs_scaled = robust_scaler.fit_transform(df_normalized['quantity_purchased'].values.reshape(-1,1))
df_normalized['quantity_purchased'] = rs_scaled

# interested people may research the maths behind min-max scaler and
# robust_scaler and standard scaler.

In [66]:
display(df_normalized.head())

,serial_no,date,user_id,user_type,product_id,quantity_purchased,price,user_class,purchase_week,encoded_user_type
27,1027,2016-03-02,5660,c,1099,0.30,2220.32,existing,9,2.0
31,1031,2016-03-02,5666,d,1080,0.35,1534.68,loyal_existing,9,3.0
32,1032,2016-02-01,5820,c,1074,0.75,1240.45,existing,5,2.0
36,1036,2016-05-02,5388,d,168,-0.45,5995.70,loyal_existing,18,3.0
39,1039,2016-02-01,5564,a,185,-0.10,5134.82,new,5,0.0

### Data Summarization

Data summarization refers to the process of preparing a compact representation of raw data at hand. This process involves aggregation of data using different statistical, mathematical, and other methods. Summarization is helpful for visualization, compressing raw data, and better understanding of its attributes.

Condition based aggregation

In [146]:
print("Mean price of items purchased by user_type=a :: {}".format(df['price'][df['user_type']=='a'].mean()))

Mean price of items purchased by user_type=a :: 2101.9403827751194

Condtion based counts

In [147]:
print(df['purchase_week'].value_counts())
# counts the number of transactions per week

3     161
4     159
2     110
13     56
44     52
9      50
53     48
31     47
39     46
5      45
26     42
35     41
22     41
0      31
18     26
48     25
17     20
Name: purchase_week, dtype: int64

### Group By

Group By certain attributes

In [149]:
print(df.groupby(['user_class'])['quantity_purchased'].sum())
# This statement generates a tabular output representing 
# sum of quantities purchased by each user_class.

user_class
error              659
existing          5049
loyal_existing    5251
new               9492
Name: quantity_purchased, dtype: int32

Group By with different aggregate functions

In [150]:
# The groupby() function is a powerful interface that allows us 
# to perform complex groupings and aggregations.
# With groupby() we can perform multi-attribute groupings 
# and apply multiple aggregations across attributes.

# variant-1: multiple aggregations on single attribute
display(df.groupby(['user_class'])['quantity_purchased'].agg([np.sum,
                                                                np.mean,
                                                                np.count_nonzero]))

                 sum       mean  count_nonzero
user_class
error            659  21.966667             30
existing        5049  20.115538            251
loyal_existing  5251  20.431907            257
new             9492  20.545455            462

Group by specific aggregate functions for each attribute

In [151]:
# variant-2: different aggregation functions for each attribute
display(df.groupby(['user_class','user_type']).agg({'price':np.mean,
                                                        'quantity_purchased':np.max}))

                                price  quantity_purchased
user_class     user_type
error          n          2909.582667                  39
existing       c          2385.705885                  41
loyal_existing d          2213.908193                  41
new            a          2101.940383                  41
               b          2171.824244                  41

Group by with multiple agg for each attribute

In [152]:
# Variant 3: Here, we do a combination of variants 1 and 2, 
# i.e., we apply multiple aggregations on the price field while 
# applying only a single one on quantity_purchased. 
# Note : a dictionary is passed, as shown in the snippet.
display(df.groupby(['user_class','user_type']).agg({'price':{  'total_price':np.sum,
                                                                'mean_price':np.mean,
                                                                'variance_price':np.std,
                                                                'count':np.count_nonzero},
                                                   'quantity_purchased':np.sum}))

                               price                                     \
                         total_price   mean_price variance_price  count
user_class     user_type
error          n            87287.48  2909.582667    1968.091733   30.0
existing       c           579726.53  2385.705885    1661.674534  251.0
loyal_existing d           551263.14  2213.908193    1521.597962  257.0
new            a           439305.54  2101.940383    1600.018728  216.0
               b           516894.17  2171.824244    1459.375193  246.0

                         quantity_purchased
                                        sum
user_class     user_type
error          n                        659
existing       c                       5049
loyal_existing d                       5251
new            a                       4522
               b                       4970

Recommeded work :
-----------------
Apart from groupby() based summarization, other functions such as pivot(), pivot_table(), stack(), unstack(), crosstab(), and melt() provide capabilities to reshape the pandas dataframe as per requirements. 

A complete description of these methods with examples is available as part of pandas documentation at 
https://pandas.pydata.org/pandas-docs/stable/reshaping.html. 
I recommend you to go through the same.

### Pivot Tables

In [160]:
display(df.pivot_table(index='date',columns='user_type',values='user_id',aggfunc = np.count_nonzero))
# pivot table shows us comprehensive information of mean price 
# date-wise , user_type wise

user_type      a     b     c     d    n
date
2016-01-01   4.0   7.0   8.0   3.0  1.0
2016-01-02   6.0   2.0  10.0   6.0  1.0
2016-01-13   7.0  10.0   3.0   5.0  1.0
2016-01-14   4.0   5.0   4.0   8.0  1.0
2016-01-15   4.0   4.0   1.0   9.0  NaN
2016-01-16   5.0   4.0   5.0   4.0  NaN
2016-01-17   3.0   4.0   7.0  12.0  NaN
2016-01-18   5.0   4.0   2.0   7.0  2.0
2016-01-19   6.0   3.0   6.0   8.0  NaN
2016-01-20   5.0   6.0   6.0   7.0  NaN
2016-01-21   7.0   7.0   5.0   9.0  NaN
2016-01-22   5.0   8.0   5.0   8.0  1.0
2016-01-23   3.0   5.0   4.0   5.0  1.0
2016-01-24   5.0   4.0   6.0   5.0  1.0
2016-01-25   4.0   3.0   9.0   7.0  NaN
2016-01-26   3.0   6.0  10.0   9.0  1.0
2016-01-27   6.0   2.0   6.0   4.0  NaN
2016-01-28   3.0  10.0   5.0   7.0  1.0
2016-01-29   2.0   7.0   3.0   3.0  NaN
2016-01-30   5.0   5.0   9.0   6.0  NaN
2016-01-31   6.0   4.0   8.0   5.0  NaN
2016-02-01   3.0   6.0   6.0   1.0  NaN
2016-02-02   5.0   9.0   7.0   8.0  NaN
2016-03-01  13.0   5.0   7.0   4.0  1.0
2016-03-02  10.0   5.0   2.0   3.0  NaN
2016-04-01   6.0   8.0   8.0   5.0  NaN
2016-04-02   9.0   6.0   8.0   6.0  NaN
2016-05-01   4.0   2.0   6.0   7.0  1.0
2016-05-02   3.0  10.0   6.0   7.0  NaN
2016-06-01   2.0   7.0   3.0   7.0  NaN
2016-06-02   5.0   4.0   8.0   5.0  NaN
2016-07-01   5.0   6.0   5.0   7.0  NaN
2016-07-02   6.0   2.0   7.0   4.0  NaN
2016-08-01   5.0   4.0  10.0   6.0  1.0
2016-08-02   3.0  11.0   2.0   5.0  NaN
2016-09-01   3.0  10.0   4.0   4.0  NaN
2016-09-02   3.0   2.0   8.0   7.0  NaN
2016-10-01   6.0   8.0   4.0   5.0  NaN
2016-10-02   2.0   7.0   7.0   7.0  NaN
2016-11-01   5.0   5.0   8.0   6.0  1.0
2016-11-02   7.0   7.0   6.0   7.0  NaN
2016-12-01   8.0   5.0   4.0   8.0  NaN

In [162]:
df_1=df.dropna()
df_1.pivot_table(index='date',columns='user_type',values='user_id',aggfunc = np.count_nonzero)

user_type    a   b   c   d
date
2016-01-01   4   7   8   3
2016-01-02   6   2  10   6
2016-01-13   6  10   3   5
2016-01-14   4   4   4   8
2016-01-15   4   3   1   9
2016-01-16   5   4   4   3
2016-01-17   3   4   7  11
2016-01-18   5   4   2   6
2016-01-19   5   3   6   8
2016-01-20   5   6   6   7
2016-01-21   7   7   5   9
2016-01-22   5   8   5   8
2016-01-23   3   4   4   5
2016-01-24   5   4   6   5
2016-01-25   3   3   8   7
2016-01-26   3   6   8   9
2016-01-27   6   2   6   4
2016-01-28   2  10   4   7
2016-01-29   2   7   2   3
2016-01-30   4   5   9   6
2016-01-31   6   4   8   5
2016-02-01   3   6   6   1
2016-02-02   5   8   7   8
2016-03-01  13   5   7   4
2016-03-02   9   5   2   3
2016-04-01   6   8   8   5
2016-04-02   8   6   8   6
2016-05-01   4   2   6   7
2016-05-02   3  10   6   6
2016-06-01   2   5   3   7
2016-06-02   5   4   8   5
2016-07-01   5   6   5   5
2016-07-02   6   2   7   4
2016-08-01   5   4   9   6
2016-08-02   3  11   2   5
2016-09-01   3   9   3   4
2016-09-02   3   2   8   7
2016-10-01   6   8   4   4
2016-10-02   2   6   7   7
2016-11-01   5   5   8   6
2016-11-02   7   7   6   7
2016-12-01   8   5   4   8